In [9]:
import pandas as pd
files = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13']
climate_df = pd.DataFrame()
for file in files:
    data = pd.read_csv(f"data/climate-monthly-{file}.csv")
    climate_df = pd.concat([climate_df, data], axis=0)
climate_df.to_csv('data/climate-monthly-all.csv', index=False)

In [11]:
climate_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120522 entries, 0 to 521
Data columns (total 34 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   x                          120522 non-null  float64
 1   y                          120522 non-null  float64
 2   LATITUDE                   120522 non-null  float64
 3   LONGITUDE                  120522 non-null  float64
 4   STATION_NAME               120522 non-null  object
 5   CLIMATE_IDENTIFIER         120522 non-null  object
 6   ID                         120522 non-null  object
 7   LOCAL_DATE                 120522 non-null  object
 8   LAST_UPDATED               120522 non-null  object
 9   PROVINCE_CODE              120522 non-null  object
 10  ENG_PROVINCE_NAME          120522 non-null  object
 11  FRE_PROVINCE_NAME          120522 non-null  object
 12  LOCAL_YEAR                 120522 non-null  int64
 13  LOCAL_MONTH                120522 non-null  int64
 14  NORMAL_MEAN_TEMPERATURE    39131 non-null   float64
 15  MEAN_TEMPERATURE           98933 non-null   float64
 16  DAYS_WITH_VALID_MEAN_TEMP  120352 non-null  float64
 17  MIN_TEMPERATURE            99018 non-null   float64
 18  DAYS_WITH_VALID_MIN_TEMP   120352 non-null  float64
 19  MAX_TEMPERATURE            99003 non-null   float64
 20  DAYS_WITH_VALID_MAX_TEMP   120352 non-null  float64
 21  NORMAL_PRECIPITATION       39447 non-null   float64
 22  TOTAL_PRECIPITATION        118339 non-null  float64
 23  DAYS_WITH_VALID_PRECIP     120352 non-null  float64
 24  DAYS_WITH_PRECIP_GE_1MM    118339 non-null  float64
 25  NORMAL_SNOWFALL            26258 non-null   float64
 26  TOTAL_SNOWFALL             105670 non-null  float64
 27  DAYS_WITH_VALID_SNOWFALL   120352 non-null  float64
 28  SNOW_ON_GROUND_LAST_DAY    61134 non-null   float64
 29  NORMAL_SUNSHINE            3450 non-null    float64
 30  BRIGHT_SUNSHINE            6179 non-null    float64
 31  DAYS_WITH_VALID_SUNSHINE   21495 non-null   float64
 32  COOLING_DEGREE_DAYS        98933 non-null   float64
 33  HEATING_DEGREE_DAYS        98933 non-null   float64
dtypes: float64(24), int64(2), object(8)
memory usage: 32.2+ MB

In [17]:
climate_years_min = climate_df.groupby('STATION_NAME')['LOCAL_YEAR'].min()
climate_years_max = climate_df.groupby('STATION_NAME')['LOCAL_YEAR'].max()
climate_years = pd.merge(climate_years_min, climate_years_max, on='STATION_NAME')

In [24]:
climate_years.rename(columns={'LOCAL_YEAR_x': 'First year', 'LOCAL_YEAR_y': 'Latest year'}, inplace=True)
climate_years.value_counts('Latest year')

Latest year
2023    71
1993    30
1994    29
1992    26
1976    25
1977    24
1997    23
1984    22
1980    22
1978    22
1996    20
1995    20
1983    19
2001    19
1987    19
1979    19
1989    18
1991    18
1981    17
2006    17
2000    17
1986    17
2002    16
1982    15
1985    15
2003    15
1990    15
2007    14
1988    13
1999    13
2005    11
2008    11
2009    10
2022    10
2014    10
2004     9
2011     9
2010     8
2012     8
2015     7
1998     6
2016     5
2017     5
2018     4
2021     3
2013     3
2019     1
2020     1
dtype: int64

In [29]:
climate_years.loc[(climate_years['First year'] == 1976) & (climate_years['Latest year'] == 2023)]

                      First year  Latest year
STATION_NAME
ARMSTRONG (AUT)             1976         2023
CHALK RIVER AECL            1976         2023
COBOURG STP                 1976         2023
COLDWATER WARMINSTER        1976         2023
FERGUS MOE                  1976         2023
GEORGETOWN WWTP             1976         2023
KINGSVILLE MOE              1976         2023
MOOSONEE UA                 1976         2023
PETERBOROUGH TRENT U        1976         2023
PICKLE LAKE (AUT)           1976         2023
RAWSON LAKE                 1976         2023
ROSEVILLE                   1976         2023
TRENTON A                   1976         2023
WELCOME ISLAND (AUT)        1976         2023

In [30]:
climate_years['Years Active'] = climate_years['Latest year'] - climate_years['First year']

In [34]:
climate_years.sort_values('Years Active', ascending=False)

                      First year  Latest year  Years Active
STATION_NAME
GEORGETOWN WWTP             1976         2023            47
FERGUS MOE                  1976         2023            47
ARMSTRONG (AUT)             1976         2023            47
COLDWATER WARMINSTER        1976         2023            47
PICKLE LAKE (AUT)           1976         2023            47
...                          ...          ...           ...
GLOUCESTER TINKER           1976         1976             0
FORMOSA                     1976         1976             0
ERIEAU                      1979         1979             0
DRUMBO                      1976         1976             0
GRANTON                     1976         1976             0

[751 rows x 3 columns]

In [36]:
climate_years.value_counts('Years Active')

Years Active
2     47
1     43
0     42
4     42
3     34
6     29
17    29
18    28
9     28
5     26
11    22
19    22
8     22
20    20
21    20
7     20
13    19
14    19
10    19
16    18
23    17
29    16
26    15
15    14
47    14
25    13
31    13
28    11
12    11
24    11
22    10
30     8
27     7
32     6
36     5
37     5
38     5
34     4
45     3
35     3
39     3
41     2
46     2
33     2
40     1
43     1
dtype: int64